[
    {
        "title": "Alurone",
        "id": 1,
        "description": "A Alurone é uma página de um restaurante online, onde oferece pratos variádos para todo gosto! Neste projeto foi explorado muitos aspectos da biblioteca react-router-dom para a criação das rotas da aplicação. Foi ultilizado a ferramenta Eslint, uma ferramenta para análise e padronização da escrita do código. Também foi implementado neste projeto as renderizações condicionais de estilos com a biblioteca ClassNames.",
        "keyWords": [
           "ESLint",
           "react-router-dom",
           "nested routes "
        ]
    },
    {
        "title": "Alura Space",
        "id": 2,
        "description": " Alura Space é uma página escrita em React js  onde é possível manipular uma galeria de fotos do espaço! O principal motivo de desenvolvimento dessa página é aprendizado sobre manipulação de estados, entender sobre arquivos estáticos, introduçãoao Sass e como fazer o deploy na vercel.",
        "keyWords": [
            "Manipulação de estado",
            "Arquivos estáticos",
            "Sass"
        ]
    },
    {
        "title": "Alura Studies",
        "id": 3,
        "description": "O Alura Studies é um organizador de estudos, onde o usuário pode definir o tempo de estudo de cada matéria que deseja estudar. Esse projeto foi criado com o intuito de treinar e compreender conceitos como: O DRY (Don't Repeat Yourself) que se refere a prática de evitar a repetição de código ou em outras palavras, significa escrever o mínimo possível de código redundante ou duplicado. O SRP (Single Responsibility Principle) que se refere ao  Princípio da Responsabilidade Única que é um dos princípios fundamentais do SOLID, um conjunto de diretrizes para se escrever um código limpo. O useEffect que é um dos hooks mais fundamentais do react que é usado para lidar com os efeitos colaterais em componentes funcionais.",
        "keyWords": [
            "DRY (Don't Repeat Yourself)",
            "SRP (Single Responsibility Principle)",
            "useEffect"
        ]
    },
    {
        "title": "Organo",
        "id": 4,
        "description": "O Organo é um sistema de cadastro de aquads em que o administrador pode organizar sua equipe, adicionando ou removendo integrantes. Esse projeto foi minha primeira transição do Javascript para o seu superset TypeScripts, um conjunto de ferramentas javaScript que adiciona tipagem e novos recursos na linguagem. Neste projeto eu aprendi sobre o Destructuring, uma expressão do Javascript que permite descompactar valores de um array ou propriedades de um objeto em variáveis distintas. Esse recurso é muito interessante quando se precisa passa props para um componente de função por exemplo. Também foi explorado a funcionalidade Generics <T>, que permite a criação de componentes e funções reutilizáveis e flexíveis, capazes de trabalhar com diversos tipos de dados, ao invés de se limitarem a um único tipo.",
        "keyWords": [
            "TypeScript",
            "Destructuring",
            "Generics <T>"
        ]
    },
    {
        "title": "Reconhecimento de voz",
        "id": 5,
        "description": "",
        "keyWords": [

        ]
    },
    {
        "title": "Portfolio",
        "id": 6,
        "description": "",
        "keyWords": [

        ]
    }
]