[
    {
        "title": "Alurone",
        "id": 1,
        "description": "A Alurone é uma página de um restaurante online, onde oferece pratos variádos para todo gosto! Neste projeto foi explorado muitos aspectos da biblioteca react-router-dom para a criação das rotas da aplicação. Foi ultilizado a ferramenta Eslint, uma ferramenta para análise e padronização da escrita do código. Também foi implementado neste projeto as renderizações condicionais de estilos com a biblioteca ClassNames.",
        "keyWords": [
           "ESLint",
           "react-router-dom",
           "nested routes "
        ]
    },
    {
        "title": "Alura Space",
        "id": 2,
        "description": "Alura Space é uma página escrita com a biblioteca React js, onde é possível manipular uma galeria de fotos do espaço! O principal motivo de desenvolvimento dessa página é o aprendizado sobre manipulação de estados com o useState, uma função de hook, introduzida na versão 16.8 da biblioteca, que permite que os componentes funcionais tenham estado (state). Entender sobre como lidar com arquivos estáticos como imagens, fontes ou arquivos de estilo e a introdução e utilização do Sass (Syntactically Awesome Style Sheets), que adiciona recursos e funcionalidades poderosas ao CSS, tornando a escrita de estilos para páginas web mais eficiente e organizada.",
        "keyWords": [
            "Manipulação de estado",
            "Arquivos estáticos",
            "Sass"
        ]
    },
    {
        "title": "Alura Studies",
        "id": 3,
        "description": "O Alura Studies é um organizador de estudos, onde o usuário pode definir o tempo de estudo de cada matéria que deseja estudar. Esse projeto foi criado com o intuito de treinar e compreender conceitos como: O DRY (Don't Repeat Yourself) que se refere a prática de evitar a repetição de código ou em outras palavras, significa escrever o mínimo possível de código redundante ou duplicado. O SRP (Single Responsibility Principle) que se refere ao  Princípio da Responsabilidade Única que é um dos princípios fundamentais do SOLID, um conjunto de diretrizes para se escrever um código limpo. O useEffect que é um dos hooks mais fundamentais do react que é usado para lidar com os efeitos colaterais em componentes funcionais.",
        "keyWords": [
            "DRY (Don't Repeat Yourself)",
            "SRP (Single Responsibility Principle)",
            "UseEffect"
        ]
    },
    {
        "title": "Organo",
        "id": 4,
        "description": "O Organo é um sistema de cadastro de aquads em que o administrador pode organizar sua equipe, adicionando ou removendo integrantes. Esse projeto foi minha primeira transição do Javascript para o seu superset TypeScripts, um conjunto de ferramentas javaScript que adiciona tipagem e novos recursos na linguagem. Neste projeto eu aprendi sobre o Destructuring, uma expressão do Javascript que permite descompactar valores de um array ou propriedades de um objeto em variáveis distintas. Esse recurso é muito interessante quando se precisa passa props para um componente de função por exemplo. Também foi explorado a funcionalidade Generics <T>, que permite a criação de componentes e funções reutilizáveis e flexíveis, capazes de trabalhar com diversos tipos de dados, ao invés de se limitarem a um único tipo.",
        "keyWords": [
            "TypeScript",
            "Destructuring",
            "Generics <T>"
        ]
    },
    {
        "title": "Reconhecimento de voz",
        "id": 5,
        "description": "Esse é um projeto de um jogo de adivinhações que pode reconhecer sua voz na hora de dar seus palpites! Todo o projeto é construído com apenas com HTML, CSS e Javascript, que foram um dos meus primeiros contatos com o desenvolvimento WEB. Apesar de simples, esse jogo traz recursos bem interessantes como o uso da Web speech API, uma API desenvolvida pela W3C (World Wide Web Consortium) que permite que os desenvolvedores adicionem recursos de reconhecimento de fala e síntese de fala em aplicativos da web. Também pode se destacar a lógica criada para a validação de resultados informando ao usuário se seu palpite está perto ou longe da resposta correta.",
        "keyWords": [
            "Reconhecimento de voz",
            "Lógica de validação"
        ]
    },
    {
        "title": "Portfolio",
        "id": 6,
        "description": "Esse foi o meu primeiro portfólio, onde utilizei  a ferramenta Figman para a prototipação da página. todo o projeto está escrito em HTML, CSS e javascript. Com o tempo de estudo eu decidi que precisaria de um ambiente construído por mim, onde eu pudesse compartilhar o que eu estava aprendendo e poder “vender meu peixe” é claro 😂! Isso me motivou a fazer mais projetos para aumentar o número das postagens. Todo layout foi pensado para ser uma página única e de forma responsiva para os diferentes tipos de dispositivos, utilizando recursos como Media Queries, CSS grid e Flexbox para realizar as adaptações.",
        "keyWords": [
            "Figman",
            "Responsividade",
            "CSS Grid"
        ]
    }
]